## 3. Import the required packages with their customary aliases as follows:

    import pandas as pd

    import numpy as np

    import matplotlib.pyplot as plt

    import seaborn as sns

## 4. Use the %matplotlib inline magic command so that your plots show in the notebook without having to call plt.show() every time.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

## 5.Using the pandas read_csv() method, read the GDP dataset into your notebook as a DataFrame called gdp_df. Take a look at the first 6 rows.

In [2]:
gdp_df = pd.read_csv("..\data\gdp_percapita.csv",nrows = 6729)

In [3]:
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

## 6. Repeat for the internet use dataset. Call this DataFrame internet_df. Take a look at the first six rows.

In [4]:
internet_df = pd.read_csv("..\data\internet_use.csv", nrows=4495)

In [5]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

## 7. Look at the shape of each DataFrame - how many rows? How many columns?

In [6]:
gdp_df.shape

(6729, 4)

In [7]:
internet_df.shape

(4495, 4)

In [8]:
internet_df.columns

Index(['Country or Area', 'Year', 'Value', 'Value Footnotes'], dtype='object')

## 8. Take a look at the datatypes for the columns in each DataFrame.

In [9]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [10]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

## 9. Take a look at the last 10 rows of each DataFrame in turn.

In [11]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6719        Zimbabwe  1999  3054.064189              NaN
6720        Zimbabwe  1998  3099.076182              NaN
6721        Zimbabwe  1997  3036.422224              NaN
6722        Zimbabwe  1996  2985.856605              NaN
6723        Zimbabwe  1995  2736.486436              NaN
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN
6728        Zimbabwe  1990  2819.549467              NaN

In [12]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

 ## 10. Drop the value footnotes column from both DataFrames. Check that this worked as expected.

In [14]:
gdp_df = gdp_df.drop(columns = ['Value Footnotes'])

In [15]:
internet_df = internet_df.drop(columns = ['Value Footnotes'])

In [16]:
gdp_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [17]:
internet_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

## 11. Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [18]:
gdp_df.columns = ['Country','Year','GDP_Per_Capita']

In [19]:
gdp_df.columns

Index(['Country', 'Year', 'GDP_Per_Capita'], dtype='object')

## 12. Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [20]:
internet_df.columns = ['Country','Year','Internet_Users_Pct']

In [21]:
internet_df.columns

Index(['Country', 'Year', 'Internet_Users_Pct'], dtype='object')

## 13. Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [43]:
gdp_and_internet_use = gdp_df.merge(internet_df, how = 'outer')

In [44]:
gdp_and_internet_use

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
0               Afghanistan  2018     1734.723214                 NaN
1               Afghanistan  2017     1758.465636                 NaN
2               Afghanistan  2016     1757.023490                 NaN
3               Afghanistan  2015     1766.593077                 NaN
4               Afghanistan  2014     1795.735834            6.390000
...                     ...   ...             ...                 ...
7700  Virgin Islands (U.S.)  1997             NaN            6.948369
7701  Virgin Islands (U.S.)  1996             NaN            4.647186
7702  Virgin Islands (U.S.)  1995             NaN            2.801958
7703  Virgin Islands (U.S.)  1994             NaN            0.940645
7704  Virgin Islands (U.S.)  1990             NaN            0.000000

[7705 rows x 4 columns]

## 14. Look at the first five rows of your new DataFrame to confirm it merged correctly.

In [45]:
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     1734.723214                 NaN
1  Afghanistan  2017     1758.465636                 NaN
2  Afghanistan  2016     1757.023490                 NaN
3  Afghanistan  2015     1766.593077                 NaN
4  Afghanistan  2014     1795.735834                6.39

## 15. Look at the last five rows to make sure the data is clean and as expected.

In [46]:
gdp_and_internet_use.tail()

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
7700  Virgin Islands (U.S.)  1997             NaN            6.948369
7701  Virgin Islands (U.S.)  1996             NaN            4.647186
7702  Virgin Islands (U.S.)  1995             NaN            2.801958
7703  Virgin Islands (U.S.)  1994             NaN            0.940645
7704  Virgin Islands (U.S.)  1990             NaN            0.000000

In [47]:
gdp_and_internet_use.shape

(7705, 4)

## 16. Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

In [60]:
gdp_and_internet_use_2000s = gdp_and_internet_use[(gdp_and_internet_use['Year'] == 2004)|
                                                  (gdp_and_internet_use['Year'] == 2009)| 
                                                  (gdp_and_internet_use['Year'] == 2014)]

In [61]:
gdp_and_internet_use_2000s

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
4               Afghanistan  2014     1795.735834            6.390000
9               Afghanistan  2009     1502.354073            3.550000
14              Afghanistan  2004     1025.208245            0.105809
21                  Albania  2014    10700.993216           60.100000
26                  Albania  2009     9525.377979           41.200000
...                     ...   ...             ...                 ...
7668               Viet Nam  2009             NaN           26.550000
7673               Viet Nam  2004             NaN            7.642409
7683  Virgin Islands (U.S.)  2014             NaN           50.070000
7688  Virgin Islands (U.S.)  2009             NaN           27.396510
7693  Virgin Islands (U.S.)  2004             NaN           27.377009

[835 rows x 4 columns]

## 17. Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

In [55]:
gdp_and_internet_use_2004 = gdp_and_internet_use[gdp_and_internet_use['Year'] == 2004]

In [56]:
gdp_and_internet_use_2004

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
14              Afghanistan  2004     1025.208245            0.105809
31                  Albania  2004     7001.054082            2.420388
60                  Algeria  2004    11845.170512            4.634475
89                   Angola  2004     4604.657044            0.464815
118     Antigua and Barbuda  2004    21161.123532           24.266544
...                     ...   ...             ...                 ...
7551              Swaziland  2004             NaN            3.228685
7572                  Syria  2004             NaN            4.321594
7615     T.F.Y.R. Macedonia  2004             NaN           24.440000
7673               Viet Nam  2004             NaN            7.642409
7693  Virgin Islands (U.S.)  2004             NaN           27.377009

[278 rows x 4 columns]

In [62]:
gdp_and_internet_use_2009 = gdp_and_internet_use[gdp_and_internet_use['Year'] == 2009]

In [63]:
gdp_and_internet_use_2009

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
9               Afghanistan  2009     1502.354073             3.55000
26                  Albania  2009     9525.377979            41.20000
55                  Algeria  2009    12697.690780            11.23000
84                   Angola  2009     6292.534856             6.00000
113     Antigua and Barbuda  2009    22568.626530            42.00000
...                     ...   ...             ...                 ...
7546              Swaziland  2009             NaN             8.94000
7567                  Syria  2009             NaN            17.30000
7610     T.F.Y.R. Macedonia  2009             NaN            51.77000
7668               Viet Nam  2009             NaN            26.55000
7688  Virgin Islands (U.S.)  2009             NaN            27.39651

[279 rows x 4 columns]

In [64]:
gdp_and_internet_use_2014 = gdp_and_internet_use[gdp_and_internet_use['Year'] == 2014]

In [66]:
gdp_and_internet_use_2014

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
4               Afghanistan  2014     1795.735834                6.39
21                  Albania  2014    10700.993216               60.10
50                  Algeria  2014    13557.769757               18.09
79                   Angola  2014     6813.052106               21.26
108     Antigua and Barbuda  2014    20440.540555               64.00
...                     ...   ...             ...                 ...
7541              Swaziland  2014             NaN               27.10
7562                  Syria  2014             NaN               28.09
7605     T.F.Y.R. Macedonia  2014             NaN               68.06
7663               Viet Nam  2014             NaN               48.31
7683  Virgin Islands (U.S.)  2014             NaN               50.07

[278 rows x 4 columns]

## 18. Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab key for auto-complete options).

In [76]:
gdp_and_internet_use_2014.sort_values(by = 'Internet_Users_Pct', ascending= False).max()

Country               Zimbabwe
Year                      2014
GDP_Per_Capita          130439
Internet_Users_Pct       98.16
dtype: object

## 19. Which country had the lowest percentage of internet users in 2014? What was the percentage?

In [77]:
gdp_and_internet_use_2014.sort_values(by = 'Internet_Users_Pct', ascending= True).min()

Country               Afghanistan
Year                         2014
GDP_Per_Capita            672.682
Internet_Users_Pct              0
dtype: object

## 20. Repeat for 2004 and 2009.

In [78]:
gdp_and_internet_use_2004.sort_values(by = 'Internet_Users_Pct', ascending= True).min()

Country               Afghanistan
Year                         2004
GDP_Per_Capita            577.483
Internet_Users_Pct              0
dtype: object

In [79]:
gdp_and_internet_use_2009.sort_values(by = 'Internet_Users_Pct', ascending= True).min()

Country               Afghanistan
Year                         2009
GDP_Per_Capita            636.876
Internet_Users_Pct              0
dtype: object